Repository: IBMStreams/streamsx.network
Catalog: com.ibm.streamsx.network/impl/*/*/NetworkResources.xlf
Languages: es_es, pt_br

# CDIST0250E
source: Sorry, no output ports specified.
es_es: Lo sentimos, no se han especificado puertos de salida.
pt_br: Não há portas de saída especificadas.

# CDIST0251E
source: Sorry, not enough output filters, must specify one for each output port.
es_es: Lo sentimos, no hay filtros de salida suficientes, debe especificar uno para cada puerto de salida.
pt_br: Não há filtros de saída suficientes, deve ser especificado um para cada porta de saída.

# CDIST0252E
source: Sorry, too many output filters, must specify one for each output port.
es_es: Lo sentimos, hay demasiados filtros de salida, debe especificar uno para cada puerto de salida.
pt_br: Excessivos filtros de saída, deve ser especificado um para cada porta de saída.

# CDIST0253E
source: Sorry, either ''pcapFilename'' parameter or an input port must be specified.
es_es: Lo sentimos, se debe especificar ''pcapFilename'' o un puerto de entrada.
pt_br: O parâmetro ''pcapFilename'' ou uma porta de entrada deve ser especificada.

# CDIST0254E
source: Sorry, ''pcapFilename'' parameter and an input port cannot both be specified.
es_es: Lo sentimos, no se puede especificar el parámetro ''pcapFilename'' y un puerto de entrada.
pt_br: O parâmetro ''pcapFilename'' e uma porta de entrada não podem ser especificados juntos.

# CDIST0255E
source: Sorry, ''initDelay'' can only be specified when ''pcapFilename'' is also specified
es_es: Lo sentimos, ''initDelay'' sólo se puede especificar cuando se especifica también ''pcapFilename''
pt_br: ''initDelay'' pode ser especificado somente quando ''pcapFilename'' também for especificado

# CDIST0256E
source: Sorry, an input port cannot be specified when starting a consistent region
es_es: Lo sentimos, no se puede especificar un puerto de entrada cuando se inicia una región coherente
pt_br: Uma porta de entrada não pode ser especificada durante o início de uma região consistente

# CDIST0257E
source: The following operator cannot be the start of a consistent region: {0}.
es_es: El operador siguiente no puede ser el inicio de una región coherente: {0}.
pt_br: O operador a seguir não pode ser o início de uma região consistente: {0}.

# CDIST0258E
source: Output attribute {0} must be a {1} type.
es_es: El atributo de salida {0} debe ser un tipo {1}.
pt_br: O atributo de saída {0} deve ser do tipo {1}.

# CDIST0259E
source: The ''{0}'' parameter must refer to an attribute of type: {1}. Found {2}
es_es: El parámetro ''{0}'' debe hacer referencia a un atributo de tipo: {1}. Se ha encontrado {2}
pt_br: O parâmetro ''{0}'' deve referir-se a um atributo do tipo: {1}. Localizada {2}

# CDIST0260E
source: The ''{0}'' parameter cannot be specified when input port 1 is defined.
es_es: No se puede especificar el parámetro ''{0}'' cuando está definido el puerto de entrada 1.
pt_br: O parâmetro ''{0}'' não pode ser especificado quando a porta de entrada 1 estiver definida.

# CDIST0261E
source: Either the ''{0}'' parameter or the ''{1}'' parameter or input port 1 must be specified.
es_es: Se debe especificar el parámetro ''{0}'' o el parámetro ''{1}'' o el puerto de entrada 1.
pt_br: O parâmetro ''{0}'' ou o parâmetro ''{1}'' ou a porta de entrada 1 deve ser especificada.

# CDIST0262E
source: Either the ''{0}'' parameter or input port 1 must be specified.
es_es: Se debe especificar el parámetro ''{0}'' o el puerto de entrada 1.
pt_br: O parâmetro ''{0}'' ou a porta de entrada 1 deve ser especificada.

# CDIST0263E
source: Number of fields in record is less than expected (found: {0}, min_expected: {1}, line: {2}).
es_es: El número de campos en el registro es inferior al esperado (encontrados: {0}, mín. esperado: {1}, línea: {2}).
pt_br: O número de campos no registro é menor que o esperado (localizados: {0}, mín_esperado: {1}, linha: {2}).

# CDIST0264E
source: Unable to parse network CIDR from blocks file: {0}
es_es: No se puede analizar el CIDR de red desde el archivo de bloques: {0}
pt_br: Não é possível analisar o CIDR de rede no arquivo de blocos: {0}

# CDIST0265E
source: Unable to convert start {0} to decimal: {1}
es_es: No se puede convertir el inicio {0} a decimal: {1}
pt_br: Não é possível converter o início {0} em decimal: {1}

# CDIST0266E
source: Error parsing {0} record: {1} ({2})
es_es: Error al analizar el registro {0}: {1} ({2})
pt_br: Erro ao analisar registro {0}: {1} ({2})

# CDIST0267E
source: Unknown error while parsing {0} record: {1}
es_es: Error desconocido al analizar el registro {0}: {1}
pt_br: Erro desconhecido ao analisar o registro {0}: {1}

# CDIST0268E
source: File does not exist: {0}
es_es: El archivo no existe: {0}
pt_br: O arquivo não existe: {0}
